src/cf/InformationRegisters/CRM_НастройкиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>CRM_НастройкиПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CRM_НастройкиПользователей</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CRM_НастройкиПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/сфпНомераТелефоновДляПоиска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>сфпНомераТелефоновДляПоиска</Name>
			<Comment>Номера телефонов для поиска абонентов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерТелефона</Name>
					<Comment>Номер телефона</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Comment>Представление</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>Пользователь</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнутреннийНомер</Name>
					<Comment>Внутренний номер</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерТелефонаДляПоиска</Name>
					<Comment>Номер телефона для полнотекстового поиска</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект для поиска</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.сфпКонтактВзаимодействия</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Comment>Вид номера</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Comment>Номер строки табличной части</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonModules/CRM_МетодыМодулейОбъектовСправочников/Ext/Module.bsl
// В данный модуль вынесены методы подсистемы CRM, вызываемые из модулей типовых объектов. 
// Выносить можно только те методы, которые не вызывают стандартные методы типового модуля или обработчики форм. 
// Т.е. вызывают только те методы, что тоже вынесены из типового или не содержат таких вызовов.

// Для каждого объекта необходимо задать свою #Область с именем объекта и модуля, как он называется в метаданных.

#Область ПриЗаписи

Процедура ПриЗаписи(Источник, Отказ) Экспорт

	#Область Пользователи

	Если НЕ Отказ Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
		                      |	НастройкиПользователей.Пользователь КАК Пользователь
		                      |ИЗ
		                      |	РегистрСведений.CRM_НастройкиПользователей КАК НастройкиПользователей
		                      |ГДЕ
		                      |	НастройкиПользователей.Пользователь = &Пользователь");
		Запрос.УстановитьПараметр("Пользователь", Источник.Ссылка);
		Если Запрос.Выполнить().Пустой() Тогда
			// Создание настроек пользователя по умолчанию при первой записи.
			CRM_ПользователиПереопределяемый.CRM_ЗаполнитьНастройкиПользователяПоУмолчанию(Источник.Ссылка);
		КонецЕсли;
	КонецЕсли;

	#КонецОбласти // Пользователи

КонецПроцедуры

#КонецОбласти

#Область Справочник_Партнеры

// Осуществляет расширенный поиск партнеров.
//
// Параметры:
//  СписокПартнеров - таблица значений, заполняемая результатами поиска,
//
// Возвращаемое значение:
//   Неопределено если поиск произведен успешно.
//   Текст сообщения пользователю, если поиск неудачен.
//
Функция НайтиПартнеров(СтрокаПоиска, СписокПартнеров) Экспорт

	// настроить параметры поиска
	мОбластьПоиска = Новый Массив;
	мОбластьПоиска.Добавить(Метаданные.Справочники.Партнеры);
	мОбластьПоиска.Добавить(Метаданные.Справочники.КонтактныеЛицаПартнеров);
	мОбластьПоиска.Добавить(Метаданные.РегистрыСведений.сфпНомераТелефоновДляПоиска);
	РазмерПорции = 200;
	
	СписокПоиска = ПолнотекстовыйПоиск.СоздатьСписок(СтрокаПоиска, РазмерПорции);
	СписокПоиска.ОбластьПоиска = мОбластьПоиска;
	
	Попытка
		СписокПоиска.ПерваяЧасть();
	Исключение
		ИО = ИнформацияОбОшибке();
		Если Прав(СтрокаПоиска, 1) = "*" Тогда
			СписокПоиска = ПолнотекстовыйПоиск.СоздатьСписок("""" + Лев(СтрокаПоиска, СтрДлина(СтрокаПоиска) - 1) + """", РазмерПорции);
			СписокПоиска.ОбластьПоиска = мОбластьПоиска;
			СписокПоиска.ПерваяЧасть();
		Иначе
			ВызватьИсключение ПодробноеПредставлениеОшибки(ИО);
		КонецЕсли;
	КонецПопытки;
	
	// Возврат, если поиск не результативен.
	Если СписокПоиска.СлишкомМногоРезультатов() Тогда
		Возврат НСтр("ru = 'Слишком много результатов, уточните запрос.'");
	ИначеЕсли СписокПоиска.ПолноеКоличество() = 0 Тогда
		Возврат НСтр("ru = 'Ничего не найдено'");
	КонецЕсли;
	КоличествоЭлементов = СписокПоиска.ПолноеКоличество();
	
	// Сформировать список найденных партнеров.
	СписокПартнеров.Очистить();
	НачальнаяПозиция = 0;
	КонечнаяПозиция = ?(КоличествоЭлементов>РазмерПорции,РазмерПорции,КоличествоЭлементов)-1;
	ЕстьСледующаяПорция = Истина;
	
	КИПредставлениеСиноним		= Метаданные.Справочники.Партнеры.ТабличныеЧасти.КонтактнаяИнформация.Реквизиты.Представление.Синоним;
	КИЗначенияПолейСиноним		= Метаданные.Справочники.Партнеры.ТабличныеЧасти.КонтактнаяИнформация.Реквизиты.ЗначенияПолей.Синоним;
	СтрокаПоискаВРег			= ВРег(СтрокаПоиска);
	
	// Обработать по порциям результаты ППД.
	Пока ЕстьСледующаяПорция Цикл
		Для СчетчикЭлементов = 0 По КонечнаяПозиция Цикл
			// Сформировать элемент результата.
			Элемент = СписокПоиска.Получить(СчетчикЭлементов);
			Если ТипЗнч(Элемент.Значение) = Тип("РегистрСведенийКлючЗаписи.сфпНомераТелефоновДляПоиска") Тогда
				Если ТипЗнч(Элемент.Значение.Объект) = Тип("СправочникСсылка.Партнеры") Или ТипЗнч(Элемент.Значение.Объект) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
					ЭлементСсылка = Элемент.Значение.Объект;
				Иначе
					Продолжить;
				КонецЕсли;
			Иначе
				ЭлементСсылка = Элемент.Значение.Ссылка;
			КонецЕсли;
			
			Если КоличествоЭлементов < 20 Тогда // Ограничение - если количество найденных много не будем усложнять описание.
				Если	Лев(Элемент.Описание, СтрДлина(КИПредставлениеСиноним)) = КИПредставлениеСиноним
					Или	Лев(Элемент.Описание, СтрДлина(КИЗначенияПолейСиноним)) = КИЗначенияПолейСиноним Тогда
					// Считаем, что нашли в контактной информации.
					бНайдено = Ложь;
					
					// Обход контактной информации вручную - попытка определить, где нашли.
					Для Каждого СтрокаТаблицы Из ЭлементСсылка.КонтактнаяИнформация Цикл
						Если	Найти(ВРег(СтрокаТаблицы.Представление),		СтрокаПоискаВРег) > 0
							Или	Найти(ВРег(СтрокаТаблицы.ЗначенияПолей),		СтрокаПоискаВРег) > 0
							Или	Найти(ВРег(СтрокаТаблицы.Страна),				СтрокаПоискаВРег) > 0
							Или	Найти(ВРег(СтрокаТаблицы.Регион),				СтрокаПоискаВРег) > 0
							Или	Найти(ВРег(СтрокаТаблицы.Город),				СтрокаПоискаВРег) > 0
							Или	Найти(ВРег(СтрокаТаблицы.АдресЭП),				СтрокаПоискаВРег) > 0
							Или	Найти(ВРег(СтрокаТаблицы.ДоменноеИмяСервера),	СтрокаПоискаВРег) > 0 Тогда
							//
							бНайдено = Истина;
							ЭлементОписание = СокрЛП(СтрокаТаблицы.Вид) + ": " + СтрокаТаблицы.Представление;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					
					Если Не бНайдено Тогда
						ЭлементОписание = Элемент.Описание;
					КонецЕсли;
				Иначе
					ЭлементОписание = Элемент.Описание;
				КонецЕсли;
			Иначе
				ЭлементОписание = Элемент.Описание;
			КонецЕсли;
			
			Попытка
				СтрПредставлениеОбъекта = Элемент.Метаданные.ПредставлениеОбъекта + " """;
				Основание = СтрПредставлениеОбъекта + Элемент.Представление + """ - " + ЭлементОписание;
			Исключение
				Если ТипЗнч(ЭлементСсылка) = Тип("СправочникСсылка.Партнеры") Тогда
					СтрПредставлениеОбъекта = НСтр("ru = 'Клиент'") + " """ + Строка(ЭлементСсылка) + """";
				ИначеЕсли ТипЗнч(ЭлементСсылка) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
					СтрПредставлениеОбъекта = НСтр("ru = 'Контактное лицо'") + " """ + Строка(ЭлементСсылка) + """";
				Иначе
					СтрПредставлениеОбъекта = "";
				КонецЕсли;
				Если ТипЗнч(Элемент.Значение) = Тип("РегистрСведенийКлючЗаписи.сфпНомераТелефоновДляПоиска") Тогда
					НомерТелефона = ПолучитьНомерТелефонаПоЭлементуПоиска(Элемент.Значение.Объект, Элемент.Значение.Вид, Элемент.Значение.ПорядковыйНомер);
					Основание = "" + СтрПредставлениеОбъекта + "- " + "Номер Телефона: " + НомерТелефона ;
				Иначе
					Основание = ?(Не ЗначениеЗаполнено(СтрПредставлениеОбъекта), """" + Элемент.Представление + """", СтрПредставлениеОбъекта)
					+ " - " + ЭлементОписание;					
				КонецЕсли;					
				//
			КонецПопытки;
			
			Если ТипЗнч(ЭлементСсылка) = Тип("СправочникСсылка.Партнеры") Тогда
				Партнер = ЭлементСсылка;
			ИначеЕсли ТипЗнч(ЭлементСсылка) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
				Партнер = ЭлементСсылка.Владелец;
			Иначе
				Продолжить;
			КонецЕсли;
			Если НЕ ДобавитьПартнераВСписокНайденныхПолнотекстовымПоиском(СписокПартнеров,Партнер,Основание,ЭлементСсылка) Тогда
				Возврат НСтр("ru = 'Слишком много результатов, уточните запрос.'");					
			КонецЕсли;
		КонецЦикла;
		НачальнаяПозиция = НачальнаяПозиция + РазмерПорции;
		ЕстьСледующаяПорция = (НачальнаяПозиция < КоличествоЭлементов - 1);
		Если ЕстьСледующаяПорция Тогда
			КонечнаяПозиция = 
			?(КоличествоЭлементов > НачальнаяПозиция + РазмерПорции, РазмерПорции,
			КоличествоЭлементов - НачальнаяПозиция) - 1;
			СписокПоиска.СледующаяЧасть();
		КонецЕсли;
	КонецЦикла;
	Если СписокПартнеров.Количество() = 0 Тогда
	     Возврат НСтр("ru = 'Ничего не найдено.'");		
	КонецЕсли;
	Возврат Неопределено;

КонецФункции

Функция ДобавитьПартнераВСписокНайденныхПолнотекстовымПоиском(СписокПартнеров,Партнер,Основание,ЭлементСсылка)
	
	// Добавить элемент, если партнера еще нет в списке найденных.
	Если СписокПартнеров.Найти(Партнер,"Партнер") = Неопределено Тогда
		// Ограничить количество возвращаемых партнеров.
		Если СписокПартнеров.Количество() > 100 Тогда
			Возврат Ложь; 
		Иначе 
			Запись = СписокПартнеров.Добавить();
			Запись.Партнер = Партнер;
			Запись.Основание = Основание;
			Запись.Ссылка = ЭлементСсылка;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции // ДобавитьПартнераВСписокНайденныхПолнотекстовымПоиском()

// Функция возвращает представление телефона для найденного элемента полнотекстового поиска.
//
//  Параметры:
//   Объект - СправочникСсылка - Ссылка на найденный элемент.
//   Вид	- Вид контактной информации - Ссылка на вид КИ.
//   Порядковый номер - Число - Порядковый номер КИ (нужен для однозначного сопоставления).
//
//  Возвращаемое значение:
//   СтрокаПредставления - Строка - Представление найденного номера телефона.
//
Функция ПолучитьНомерТелефонаПоЭлементуПоиска(Объект, Вид, ПорядковыйНомер)
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	|	сфпНомераТелефоновДляПоиска.НомерТелефона,
	|	сфпНомераТелефоновДляПоиска.Представление
	|ИЗ
	|	РегистрСведений.сфпНомераТелефоновДляПоиска КАК сфпНомераТелефоновДляПоиска
	|ГДЕ
	|	сфпНомераТелефоновДляПоиска.Объект = &Объект
	|	И сфпНомераТелефоновДляПоиска.Вид = &Вид
	|	И сфпНомераТелефоновДляПоиска.ПорядковыйНомер = &ПорядковыйНомер";
	
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("Вид", Вид);
	запрос.УстановитьПараметр("ПорядковыйНомер", ПорядковыйНомер);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Представление;
	Иначе
		Возврат "";
	КонецЕсли;		
	
КонецФункции	

#КонецОбласти  //Справочник_Партнеры
